import type { Messages } from '../types';

const ru: Messages = {
  lang: {
    ariaLabel: 'Переключить язык',
  },

  header: {
    logoTitle: 'Главная',
    header: 'Хедер',
  },

  headerActions: {
    search: 'поиск',
    notifications: 'уведомления',
  },

  BurgerButton: {
    title: 'Открыть меню',
  },

  link: {
    home: 'Главная',
    catalog: 'Фильмы и сериалы',
    movies: 'Фильмы',
    shows: 'Сериалы',
    support: 'Поддержка',
    subscriptions: 'Подписки',
  },

  footerLink: {
    home: 'Главная',
    homeCategories: 'Категории',
    homeDevices: 'Устройства',
    homePricing: 'Цены',
    homeFaq: 'FAQ',
    movies: 'Фильмы',
    moviesGenres: 'Жанры',
    moviesTrending: 'Тренды',
    moviesNew: 'Новинки',
    moviesPopular: 'Популярное',
    shows: 'Сериалы',
    showsGenres: 'Жанры',
    showsTrending: 'Тренды',
    showsNew: 'Новинки',
    showsPopular: 'Популярное',
    support: 'Поддержка',
    supportContact: 'Связаться с нами',
    subscriptions: 'Подписки',
    subscriptionsPlans: 'Тарифы',
    subscriptionsFeatures: 'Особенности',
    termsOfUse: 'Terms of Use',
    privacyPolicy: 'Privacy Policy',
    cookiePolicy: 'Cookie Policy',
  },

  socials: {
    title: 'Связаться с нами',
    facebook: 'Facebook',
    x: 'X',
    linkedin: 'LinkedIn',
  },

  banner: {
    cta: 'Начать бесплатный пробный период',
    title: 'Начните бесплатный пробный период уже сегодня!',
    description:
      'Откройте для себя мир безграничных развлечений вместе со StreamVibe. Смотрите любимые фильмы и сериалы бесплатно в течение пробного периода.',
  },

  main: {
    pageTitle: 'Главная',
    meta: 'Главная страница Stream Vibe',
  },

  playButton: {
    title: 'Запустить видео',
  },

  hero: {
    title: 'Новый уровень стриминга',
    descr:
      'StreamVibe — это лучший стриминговый сервис для просмотра любимых фильмов и сериалов по запросу — в любое время и в любом месте. Со StreamVibe вы получаете доступ к огромному выбору контента: от новейших блокбастеров и классики кино до популярных сериалов и многого другого. Вы также можете создавать собственные списки просмотра, чтобы быстро находить то, что хотите посмотреть.',
    cta: 'Начать просмотр',
  },

  categories: {
    title: 'Выбирайте из множества категорий',
    descr: `Хотите посмеяться, задуматься или узнать что-то новое? У нас найдётся контент для любого настроения`,
  },

  CatalogItemCard: {
    durationHours: 'ч',
    durationMinutes: 'мин',
    releasedAt: 'Релиз',
    ariaLabels: {
      duration: 'длительность',
      views: 'просмотры',
      rating: 'рейтинг',
      season: 'Сезон',
    },
  },

  slider: {
    nextButton: 'Следующий слайд',
    prevButton: 'Предыдущий слайд',
  },

  devices: {
    title: 'Мы обеспечиваем удобный стриминг на любых устройствах',
    descr:
      'Смотрите любимые фильмы и сериалы где угодно и когда угодно вместе со StreamVibe. Платформа отлично работает на самых разных устройствах, обеспечивая комфортный просмотр в любой ситуации.',
  },

  deviceCard: {
    smartphone: {
      title: 'Смартфоны',
      descr:
        'StreamVibe отлично работает на смартфонах Android и iOS. Скачайте приложение в Google Play или App Store и наслаждайтесь просмотром где угодно.',
    },

    console: {
      title: 'Игровые консоли',
      descr:
        'Смотрите любимые фильмы и сериалы прямо на игровых консолях. StreamVibe обеспечивает плавный и удобный просмотр на больших экранах.',
    },

    laptop: {
      title: 'Ноутбуки',
      descr:
        'Наслаждайтесь просмотром на ноутбуках с максимальным комфортом. StreamVibe поддерживает все современные браузеры и устройства.',
    },

    tablet: {
      title: 'Планшеты',
      descr:
        'Смотрите контент на планшетах в любое время и в любом месте. Удобный интерфейс делает просмотр ещё приятнее.',
    },

    tv: {
      title: 'Смарт-ТВ',
      descr:
        'Превратите свой телевизор в настоящий кинотеатр со StreamVibe. Наслаждайтесь любимым контентом на большом экране.',
    },

    vr: {
      title: 'VR-гарнитуры',
      descr:
        'Погрузитесь в новый уровень развлечений с поддержкой VR-устройств и получите ещё более захватывающий опыт просмотра.',
    },
  },
  questions: {
    title: 'Часто задаваемые вопросы',
    descr:
      'Остались вопросы? У нас есть ответы! Загляните в раздел FAQ, чтобы найти ответы на самые популярные вопросы о StreamVibe.',
    action: 'Задать вопрос',
    items: {
      whatIsStreamVibe: {
        question: 'Что такое StreamVibe?',
        answer:
          'StreamVibe — это стриминговый сервис, который позволяет смотреть фильмы и сериалы по запросу в любое время и на любом устройстве.',
      },

      cost: {
        question: 'Сколько стоит StreamVibe?',
        answer:
          'StreamVibe предлагает несколько тарифных планов с разными возможностями и ценами, чтобы каждый пользователь мог выбрать подходящий вариант.',
      },

      content: {
        question: 'Какой контент доступен на StreamVibe?',
        answer:
          'На StreamVibe доступны новинки кино, популярные сериалы, классические фильмы, документальные проекты и многое другое.',
      },

      howToWatch: {
        question: 'Как смотреть StreamVibe?',
        answer:
          'Вы можете смотреть StreamVibe через браузер или приложение на смартфонах, планшетах, ноутбуках, Smart TV и игровых консолях.',
      },

      sign: {
        question: 'Как зарегистрироваться в StreamVibe?',
        answer:
          'Создать аккаунт очень просто — достаточно указать email, придумать пароль и выбрать подходящий тарифный план.',
      },

      trial: {
        question: 'Есть ли у StreamVibe бесплатный пробный период?',
        answer:
          'Да, новые пользователи могут воспользоваться бесплатным пробным периодом, чтобы познакомиться с возможностями платформы.',
      },

      support: {
        question: 'Как связаться с поддержкой StreamVibe?',
        answer:
          'Вы можете обратиться в нашу службу поддержки через форму обратной связи или по электронной почте в любое время.',
      },

      payment: {
        question: 'Какие способы оплаты поддерживает StreamVibe?',
        answer:
          'Мы поддерживаем оплату банковскими картами, цифровыми кошельками и другими популярными способами оплаты.',
      },
      duplicate: {
        question: 'Какие способы оплаты поддерживает StreamVibe?',
        answer:
          'Мы поддерживаем оплату банковскими картами, цифровыми кошельками и другими популярными способами оплаты.',
      },
    },
  },

  plans: {
    title: 'Выберите тариф, который подходит именно вам',
    descr:
      'Присоединяйтесь к StreamVibe и выбирайте гибкие тарифные планы, созданные с учётом ваших предпочтений. Наслаждайтесь развлечениями без ограничений!',
    mainAction: 'Выбрать подписку',
    secondaryAction: 'Попробовать бесплатно',
    periods: {
      day: 'день',
      week: 'неделя',
      month: 'месяц',
      year: 'год',
    },
    tabs: {
      monthly: 'на месяц',
      yearly: 'на год',
    },
    approxPriceDisclaimer:
      'Примерная стоимость по текущему курсу. Итоговая сумма при оплате может отличаться.',
    items: {
      basic: {
        title: 'Базовый тариф',
        descr:
          'Наслаждайтесь большой библиотекой фильмов и сериалов, включая популярные новинки и разнообразный контент на любой вкус.',
      },

      standard: {
        title: 'Стандартный тариф',
        descr:
          'Получите доступ к ещё большему выбору фильмов и сериалов, включая большинство новинок и эксклюзивный контент.',
      },

      premium: {
        title: 'Премиум тариф',
        descr:
          'Откройте доступ к самой большой коллекции фильмов и сериалов, включая все новинки и возможность офлайн-просмотра.',
      },
    },
  },

  catalogPage: {
    pageTitle: 'Фильмы и сериалы',
    meta: 'Каталог фильмов и сериалов',
    heading: 'Фильмы и сериалы',
    cta: 'Смотреть',
    actions: {
      add: 'В плейлист',
      like: 'Нравится',
      sound: 'Без звука',
    },
    catalogSections: {
      movies: 'Фильмы',
      shows: 'Сериалы',
    },
  },
  catalogEntity: {
    movie: {
      title: 'Фильм',
      meta: 'О фильме',
      details: 'Описание и обзоры',
      description: 'Сюжет',
      cast: 'В ролях',
      reviews: 'Отзывы',
      addReview: 'Написать отзыв',
      editReview: 'Редактировать отзыв',
      rating: 'Оценка',
      release: 'Год выпуска',
      languages: 'Доступные языки',
      ratings: 'Рейтинги',
      genres: 'Жанры',
      director: 'Режиссёр',
      music: 'Композитор',
    },
    show: {
      title: 'Сериал',
      meta: 'О сериале',
      details: 'Описание и обзоры',
      description: 'Сюжет',
      cast: 'В ролях',
      reviews: 'Отзывы',
      addReview: 'Написать отзыв',
      editReview: 'Редактировать отзыв',
      rating: 'Оценка',
      release: 'Год выпуска',
      languages: 'Доступные языки',
      ratings: 'Рейтинги',
      genres: 'Жанры',
      director: 'Режиссёр',
      music: 'Композитор',
    },

    reviewModal: {
      titleAdd: 'Добавить отзыв',
      titleEdit: 'Редактировать отзыв',
      name: 'Ваше имя',
      country: 'Ваша страна',
      rating: 'Оценка',
      review: 'Отзыв',
      submit: 'Отправить отзыв',
      save: 'Сохранить изменения',
      deleteReview: 'Удалить отзыв',
      deleteReviewConfirm: 'Удалить этот отзыв?',
      cancel: 'Отмена',
      delete: 'Удалить',
    },
  },

  formLabel: {
    required: 'Оязательное поле',
  },
};

export default ru;
